benchmarkResults/benchmark_fast.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /fast
Document Length:        15 bytes

Concurrency Level:      100
Time taken for tests:   0.354 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      214000 bytes
HTML transferred:       15000 bytes
Requests per second:    2827.05 [#/sec] (mean)
Time per request:       35.373 [ms] (mean)
Time per request:       0.354 [ms] (mean, across all concurrent requests)
Transfer rate:          590.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     3   34   6.7     34      60
Waiting:        1   33   6.8     34      60
Total:          3   34   6.8     34      61

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     37
  75%     38
  80%     39
  90%     41
  95%     42
  98%     54
  99%     58
 100%     61 (longest request)