benchmarkResults/benchmark_memory.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /memory
Document Length:        42 bytes

Concurrency Level:      100
Time taken for tests:   0.216 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      242000 bytes
HTML transferred:       42000 bytes
Requests per second:    4627.14 [#/sec] (mean)
Time per request:       21.612 [ms] (mean)
Time per request:       0.216 [ms] (mean, across all concurrent requests)
Transfer rate:          1093.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     4   20   3.1     20      28
Waiting:        2   18   3.9     19      26
Total:          4   20   3.0     20      28

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     21
  75%     22
  80%     23
  90%     24
  95%     25
  98%     25
  99%     27
 100%     28 (longest request)